read_verilog /content/input/0x7A.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x7A/0x7A_yosys
write_edif /content/output/0x7A/0x7A.edif
write_json /content/output/0x7A/0x7A.json
