read_verilog /content/input/0x5C.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x5C/0x5C_yosys
write_edif /content/output/0x5C/0x5C.edif
write_json /content/output/0x5C/0x5C.json
