read_verilog /content/input/0x4A.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x4A/0x4A_yosys
write_edif /content/output/0x4A/0x4A.edif
write_json /content/output/0x4A/0x4A.json
