read_verilog /content/input/0xED.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xED/0xED_yosys
write_edif /content/output/0xED/0xED.edif
write_json /content/output/0xED/0xED.json
