read_verilog /content/input/0x26.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x26/0x26_yosys
write_edif /content/output/0x26/0x26.edif
write_json /content/output/0x26/0x26.json
