read_verilog /content/input/0x98.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x98/0x98_yosys
write_edif /content/output/0x98/0x98.edif
write_json /content/output/0x98/0x98.json
