read_verilog /content/input/0x82.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x82/0x82_yosys
write_edif /content/output/0x82/0x82.edif
write_json /content/output/0x82/0x82.json
