read_verilog /content/input/0x9E.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x9E/0x9E_yosys
write_edif /content/output/0x9E/0x9E.edif
write_json /content/output/0x9E/0x9E.json
