read_verilog /content/input/0xFC.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xFC/0xFC_yosys
write_edif /content/output/0xFC/0xFC.edif
write_json /content/output/0xFC/0xFC.json
