read_verilog /content/input/0xEE.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xEE/0xEE_yosys
write_edif /content/output/0xEE/0xEE.edif
write_json /content/output/0xEE/0xEE.json
