read_verilog /content/input/0xEF.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xEF/0xEF_yosys
write_edif /content/output/0xEF/0xEF.edif
write_json /content/output/0xEF/0xEF.json
