read_verilog /content/input/0x1F.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x1F/0x1F_yosys
write_edif /content/output/0x1F/0x1F.edif
write_json /content/output/0x1F/0x1F.json
