read_verilog /content/input/0xFD.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xFD/0xFD_yosys
write_edif /content/output/0xFD/0xFD.edif
write_json /content/output/0xFD/0xFD.json
