read_verilog /content/input/0x6A.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x6A/0x6A_yosys
write_edif /content/output/0x6A/0x6A.edif
write_json /content/output/0x6A/0x6A.json
