read_verilog /content/input/0xAD.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xAD/0xAD_yosys
write_edif /content/output/0xAD/0xAD.edif
write_json /content/output/0xAD/0xAD.json
