read_verilog /content/input/0xFA.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xFA/0xFA_yosys
write_edif /content/output/0xFA/0xFA.edif
write_json /content/output/0xFA/0xFA.json
