read_verilog /content/input/0x0B.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x0B/0x0B_yosys
write_edif /content/output/0x0B/0x0B.edif
write_json /content/output/0x0B/0x0B.json
