read_verilog /content/input/0xBA.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xBA/0xBA_yosys
write_edif /content/output/0xBA/0xBA.edif
write_json /content/output/0xBA/0xBA.json
