read_verilog /content/input/0x9F.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x9F/0x9F_yosys
write_edif /content/output/0x9F/0x9F.edif
write_json /content/output/0x9F/0x9F.json
