read_verilog /content/input/0xCB.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xCB/0xCB_yosys
write_edif /content/output/0xCB/0xCB.edif
write_json /content/output/0xCB/0xCB.json
