read_verilog /content/input/0x7D.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x7D/0x7D_yosys
write_edif /content/output/0x7D/0x7D.edif
write_json /content/output/0x7D/0x7D.json
