read_verilog /content/input/0x8C.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x8C/0x8C_yosys
write_edif /content/output/0x8C/0x8C.edif
write_json /content/output/0x8C/0x8C.json
