read_verilog /content/input/0xCD.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0xCD/0xCD_yosys
write_edif /content/output/0xCD/0xCD.edif
write_json /content/output/0xCD/0xCD.json
