read_verilog /content/input/0x5A.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x5A/0x5A_yosys
write_edif /content/output/0x5A/0x5A.edif
write_json /content/output/0x5A/0x5A.json
