read_verilog /content/input/0x3D.v
flatten
splitnets -ports
hierarchy -auto-top
proc
techmap
opt
abc -g NOR
opt
hierarchy -auto-top
opt_clean -purge
show -format pdf -prefix /content/output/0x3D/0x3D_yosys
write_edif /content/output/0x3D/0x3D.edif
write_json /content/output/0x3D/0x3D.json
